#include <stdio.h>

void countCall() {   //ประกาศตัวแปรแบบปกติ (non-static) จะถูกรีเซ็คใหม่ทุกครั้ง
    int counter = 0;
    counter++;  //แสดงค่าของ counter ซึ่งจะเป็น 1 ทุกครั้งที่เรียกฟังก์ชัน
    printf("Call Function: Counter = %d\n", counter);
}

int main() {
    printf("Starting function calls...\n");
    countCall();   // ครั้งที่ 1 => counter = 1
    printf("After first call:\n");
    countCall();   // ครั้งที่ 2 => counter = 1
    return 0;
}
/* 1. ผลลัพธ์ที่ได้ต่างกันอย่างไร? เพราะเหตุใด?
   - กรณีที่ 1 (static): ผลลัพธ์จะเพิ่มขึ้นทุกครั้งที่เรียก เช่น1,2
   - กรณีที่ 2 (non-static): ค่าจะเริ่มที่ 1 ทุกครั้ง เช่น1,1
   เพราะ static จะเก็บค่าตัวแปรไว้ในหน่วยความจำตลอดโปรแกรมส่วน non-static จะสร้างตัวแปรใหม่ทุกครั้งที่เรียกฟังก์ชัน
   2.ความแตกต่างของ Non-Static Variable?
   -ตัวแปร non-static จะมีอายุแค่ภายในฟังก์ชันที่ถูกเรียก
   -จะรีเซ็ตใหม่ทุกครั้ง ไม่สามารถจำค่าครั้งก่อนหน้าได่
   -เหมาะกับงานที่ไม่ต้องใช้ค่าต่อเนื่องระหว่างการเรียกฟังก์ชัน
   3. อภิปรายและสรุปผลที่ได้จากการทดลอง:
   - static เหมาะสำหรับงานที่ต้องการเก็บสถานะต่อเนื่อง เช่น นับจำนวนรอบ
   - non-static เหมาะกับงานที่ต้องการรีเซ็ตค่าทุกครั้ง เช่นการคำนวณเฉพาะรอบ
   - การเข้าใจและเลือกใช้ static หรือ non-static อย่างเหมาะสม จะช่วยให้โปรแกรมทำงานได้ตรงตามจุดประสงค์
*/